// Part of LocLang/HighPerfTools
// Copyright 2022-2023 Guillaume Mirey
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
// 
//     http://www.apache.org/licenses/LICENSE-2.0
// 
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License. 

#pragma once

// ************************************************************
// 'UNUSED' macro : explicitely flags some variable (typically a function parameter) as 'unused', and incidentally removes the associated warning.
// ************************************************************

#define UNUSED(var) ((void)(var))

// ************************************************************
// explicit sized typedefs
// ************************************************************
// define short identifiers for numeric types with a definite bitsize, currently working for MSVC
//   (intended to be #define'd as required for same effects under other compilers... TODO).
// ************************************************************

// floating-point: not much of a compiler dependency here

typedef float               f32;
typedef double              f64;

#if defined(_MSC_VER)  // Visual Studio Compiler

    // We have enough info about MSVC compiler to work out the explicit types without stdint.h

    typedef unsigned char        u8;
    typedef unsigned short      u16;
    typedef unsigned int        u32;
    typedef unsigned __int64    u64;

    typedef signed char          i8;
    typedef signed short        i16;
    typedef signed int          i32;
    typedef signed __int64      i64;

#  ifdef _WIN64     // 64b
    static_assert(sizeof(void*) == 8, "We assumed a 64b platform, which does not seem to be the case");
    typedef __int64          IParam; // a signed integer which is of same size as a pointer for the target architecture
    typedef unsigned __int64 UParam; // an unsigned integer which is of same size as a pointer for the target architecture
#  else             // Assumed 32b
    static_assert(sizeof(void*) == 4, "We assumed a 32b platform, which does not seem to be the case");
    typedef int              IParam; // a signed integer which is of same size as a pointer for the target architecture
    typedef unsigned int     UParam; // an unsigned integer which is of same size as a pointer for the target architecture
#  endif

#else               // Other compilers...

#  if defined(__GNUC__) || defined(__clang__)     // GCC or Clang compiler
     // TODO: we have enough info about GCC or Clang implementation choices already to work out the explicit types without stdint.h, as we did for MSVC
#    warning "under GCC or Clang, we could have defined basic types without a dependency to <stdint.h>... It remains as TODO."
#  endif 

#  include <stdint.h>     // resort to stdint.h header to ensure of the actual types.

    typedef uint8_t         u8;
    typedef uint16_t        u16;
    typedef uint32_t        u32;
    typedef uint64_t        u64;

    typedef int8_t          i8;
    typedef int16_t         i16;
    typedef int32_t         i32;
    typedef int64_t         i64;

    typedef intptr_t        IParam; // a signed integer which is of same size as a pointer for the target architecture
    typedef uintptr_t       UParam; // an unsigned integer which is of same size as a pointer for the target architecture

    #include <limits.h>  // for CHAR_BIT

    static_assert(CHAR_BIT == 8, "we require that target platform has 8-bit char, so that that bit count in any 'a' equals 8 * sizeof(a)");

#endif

static_assert(sizeof( u8) == 1, "u8 should be 8b, thus one 8b byte");
static_assert(sizeof(u16) == 2, "u16 should be 16b, thus two 8b bytes");
static_assert(sizeof(u32) == 4, "u32 should be 32b, thus four 8b bytes");
static_assert(sizeof(f32) == 4, "f32 should be 32b, thus four 8b bytes");
static_assert(sizeof(u64) == 8, "u64 should be 64b, thus eight 8b bytes");
static_assert(sizeof(f64) == 8, "f64 should be 64b, thus eight 8b bytes");
static_assert(sizeof( u8) == sizeof( i8), "u8 and i8 shall be of same size");
static_assert(sizeof(u16) == sizeof(i16), "u16 and i16 shall be of same size");
static_assert(sizeof(u32) == sizeof(i32), "u32 and i32 shall be of same size");
static_assert(sizeof(u64) == sizeof(i64), "u64 and i64 shall be of same size");
static_assert(sizeof(UParam) == sizeof(IParam), "UParam and IParam shall be of same size");
static_assert(sizeof(UParam) == sizeof(void*),  "UParam shall be the size of a pointer");
static_assert(sizeof(UParam) == sizeof(size_t), "UParam and size_t shall be of same size");

// ************************************************************
// compiler-specific FORCE_INLINE and NO_INLINE macros
// ************************************************************
// define a FORCE_INLINE macro to add before your functions (as well as a NO_INLINE macro) to give you "some" control over the compiler decision to
